#include "menu.h"
#include <stdio.h>

void menu_print(void)
{
    printf("\n");
    printf("========================================\n");
    printf("Программа для умножения матрицы на вектор-столбец.\n");
    printf("Пункты меню:\n");
    printf("1) Ввести матрицу\n");
    printf("2) Ввести вектор-столбец\n");
    printf("3) Вывести матрицу\n");
    printf("4) Вывести вектор-столбец\n");
    printf("5) Умножить матрицу на вектор-столбец\n");
    printf("6) Получить результат сравнения алгоритмов при различном проценте заполнения\n");
    printf(" 0) Завершить работу программы\n");
    printf("========================================\n");
    printf("Введите пункт: ");
}
